Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 等人走了，才有些风中凌乱的收回目光：“妈耶，刚刚那一瞬间我以为我要完了。”
en_us: After she left, some of them looked away in a flustered manner and said, "Damn it, I thought that it was going to be the end of us just now."

source: 等到下课的时候，才有人发现，有两个人不见了。
en_us: By dismissal time, someone discovered that two people had gone missing.

source: 等到晚上，秦柔回来，她便找到母亲哭诉：“妈，我不想在这里待了，你带我走吧！”
en_us: At evening, Qin Rou returned and complained to her mother tearfully, "Mother, I don't want to stay here anymore. Take me away!"

source: 等徐媛一走，一群女生也不隐藏了，毕竟当着徐媛的面不好做出格的事，这会儿她一走，她们自然是没有了顾忌，直接就围上了叶漓，冷笑连连：“没想到会在这里遇到你，真是冤家路窄，我们本来还打算去帝都大学堵人的，现在看来，不用我们出手，你倒是自己送上门来了。”
en_us: After Xu Yuan left, the girls stopped hiding. Afer all, it was inappropriate to do something outrageous in front of Xu Yuan. After she left, they naturally had no scruples. They immediately surrounded Ye Li and chuckled coldly. "I didn't expect to meet you here. Rivals often meet. We initially planned to go to Beijing University to mob you but it seems that you have come to us."

source: 等看到ys@她的消息的时候，她脸都白了。
en_us: When she saw the tweet posted by YS Fashion that she was tagged in, she turned pale.

source: 等看到自家哥哥的私信时，叶漓明白了。
en_us: Ye Li finally understood when she saw a private message from her brother.

source: 简直就像是换了个人。
en_us: She was just like a completely different person.

source: 粉丝一百五十万，认证是文艺博主。
en_us: She had 1.5 million followers and was recognized as a literature blogger.

source: 粉丝们难以置信的声音刷爆了各种评论区。
en_us: The fans expressed their disbelief in comments that flooded various comment sections.

source: 粉丝震惊不已。
en_us: His fans were all astonished.

source: 纷纷恼怒了起来：“我真没想到她竟然是这种人，亏我还一直维护她。”
en_us: They flew into a rage and sent many malicious comments. "I really didn't expect her to be such a person. I can't believe I'd been constantly defending her."

source: 终于在最好的年纪毁了她，这一直是叶眉最得意开心的事情。
en_us: Ye Mei had always been pleased and overjoyed about the fact that she had ruined Ye Li at the best age of her life.

source: 经常叼着棒棒糖，用甜来缓解饥饿。
en_us: She often sucked on a lollipop to curb her hunger pangs.

source: 经纪人看着站在阳光下依旧璀璨夺目的男人，嘴角抽了抽：“枫哥，我是你经纪人，不是助理好吧？”
en_us: The manager looked at the eye-catching man who was shining under the sun. He smirked and asked, "Ye Feng, I'm your manager, not your assistant, okay?"

source: 经纪人：“.....”
en_us: The manager was at a loss for words.

source: 结果一秒，两秒，三秒过去。
en_us: In the end, three seconds passed.

source: 结果下一秒，人家说礼服被别人定下了！
en_us: Yet, it was bought by someone else!

source: 结果人家完全就没有注意到他，依旧自顾自的威胁。
en_us: However, Meng Fei's father did not notice him at all. Instead, he continued to threaten Ye Feng for his own interests.

source: 结果却被叶眉直接刷爆！
en_us: In the end, Ye Mei maxed out her credit card!

source: 结果叶漓又改了那样一个昵称，又发了挑衅的微博，在粉丝们眼里，那就是不可饶恕的！
en_us: In the end, Ye Li changed her username and even sent a provocative tweet on Twitter. That was unforgivable in the eyes of the fans!

source: 结果大一期末考试的时候考了全班第一，就被怀疑作弊，老师也不相信她，好巧不巧的是，当时不知道谁往她的桌下丢了纸条，这一幕正好落到了监控中，叶漓弯腰捡笔的动作就成了她抄袭的实证。
en_us: In the end, she managed to top her class during the final exams in her first semester of college, and got suspected for cheating. The teacher refused to believe her and coincidentally, someone tossed a piece of paper under her table, which was captured by the surveillance cameras. Ye Li's action of bending over to grab her pen became the evidence of her cheating.

source: 结果这才回校第一天，就接到了手下的电话。
en_us: In the end, he received a call from his subordinate on the first day of her return to school.

source: 继承了母亲的深沉心机，从十几岁开始，叶眉就开始计划了。
en_us: Having inherited her mother's scheming mind, Ye Mei began planning everything since she was a teenager.

source: 网友们很快又觉得，是叶漓抢了叶眉的礼服，所以才会出现这种事情。
en_us: The netizens quickly felt that the reason for that incident was because Ye Li snatched the gown away from Ye Mei.

source: 翻出自己的校服穿上，他们的校服偏海军风，下面是百褶裙，十分好看。
en_us: She took out her school uniform, which had a navy style design and consisted of a pleated skirt. It was beautiful.

source: 老公这两个字，他这段时间已经听到好几次了。
en_us: Lately, he had heard the word 'hubby' a few times.

source: 老校长无奈的道。
en_us: The principal said helplessly.

source: 老校长觉得自己真是为这群小破孩操碎了心。
en_us: The old principal was extremely worried about this bunch of children.

source: 老爷子也看了过去，见到叶家几兄弟，脸上多了一抹笑容：“好好好，都来了，阿漓那丫头呢？”他的视线在几人身上错过。
en_us: Xu Fengnian's grandfather looked over and smiled when he saw three brothers of the Ye Family. "Great, they're all here. Where's Ye Li?" He did not pay attention to a few people.

source: 老爷子和大夫人也是疑惑的看向他，“凤年你这话是什么意思？”
en_us: Looking at him in bewilderment, Xu Fengnian's grandfather and mother asked, "Fengnian, what do you mean?"

source: 老爷子和大夫人的脸色也是瞬间缓和。
en_us: Xu Fengnian's grandfather and mother immediately looked less austere.

source: 老爷子和大夫人的脸色都很难看。
en_us: Xu Fengnian's grandfather and Mrs. Xu looked extremely upset.

source: 老爷子心里开心，也没在意，点了点头说：“坐吧。”
en_us: In high spirits, Xu Fengnian's grandfather didn't mind. He nodded and said, "Have a seat."

source: 老爷子身体不大好，用了餐便被人搀扶着上楼休息。
en_us: Xu Fengnian's grandfather was not feeling too well so a servant helped him go upstairs to rest after the meal.

source: 老爹叶明走了进来，“还不去吃饭？给谁打电话呢？这么开心，交女朋友了？”他挑了挑眉看自家儿子。
en_us: His father Ye Ming entered. "Why aren't you going for lunch yet? Who are you calling? You look so happy. Have you gotten a girlfriend?" he asked, looking at his son with raised brows.

source: 而且叶漓说的也对，要不是刚刚叶眉笃定了她做了那样的事情，自己也不会一时冲动的威胁她，犯下了这样的大错！
en_us: Besides, Ye Li was right. If it wasn't for the fact that Ye Mei was certain that Ye Li had done that, she wouldn't have gone to threaten Ye Li impulsively and made such a huge mistake!

source: 而且徐阿姨，最讨厌的就是那些打扮夸张的小姐。
en_us: Besides, Xu Fengnian's mother detested girls who liked to dress in overly exaggerated outfits.

source: 而且照她刚刚所说，叶眉是偷了她的邀请函，才来参加这个聚会的。
en_us: According to what she had just sad, Ye Mei stole her invitation to come this gathering.

source: 而且距离叶漓没来学校，不过一个多星期而已，但是这清冷的气质，这浑身散发的自信光芒，怎么看也不像是那个叶漓啊？
en_us: Besides, Ye Li had only been absent for school for a week, and the aloof aura and confidence did not seem like something Ye Li would have.

source: 而且这么看她做什么，自己没得罪他吧？
en_us: 'Besides, why is he looking at me like this? I didn't offend him, did I?"

source: 而且，她正巧和阿漓一个班....
en_us: Besides, she was coincidentally in the same class as Ye Li...

source: 而且，那些愤怒的人，还都曾是她的粉丝。
en_us: Besides, the ones who were getting infuriated used to be fans of Ye Mei.

source: 而他的左边第一个，正是穿着黑色西装，一脸冷峻的徐凤年。
en_us: On his left was the handsome and aloof Xu Fengnian who was dressed in a black suit.

source: 而另一边，叶漓吃了饭就直接从后门出去，然后直接回校。
en_us: On the other hand, Ye Li left from the back door after having had her meal. She then headed straight to school.

source: 而另一边，窝在男人怀中的叶漓上了车之后，终于从宽大的西装外套下伸出了毛茸茸的脑袋。
en_us: On the other hand, Ye Li, who was being held in Xu Fengnian's amrs, finally revealed her furry head when she was placed in the car.

source: 而叶漓还不知道发生了什么。
en_us: Ye Li did not know what happened.

source: 而叶漓这个姐姐，排名9999+前都没有她的踪迹。
en_us: On the other hand, her elder sister, Ye Li, was far from even the 9999th place.

source: 而叶眉的母亲，同样也是叶漓母亲同父异母的妹妹，甚至可以说，就是一小三的女儿，叫做秦柔。
en_us: On the other hand, Ye Mei's mother, was likewise the half-sister of Ye Li's mother. In fact, she was the daughter of a mistress, and her name was Qin Rou.

source: 而她叶漓，叶家大小姐，二十岁之前，一直是上天的宠儿。
en_us: On the other hand, Ye Li, the heiress of the Ye Family, was truly Heaven's favorite before she turned twenty.

source: 而她的母亲，留着一头泡面卷发，画着精致妆容，大热的天还披着貂皮，踩着十厘米的高跟鞋，这会儿正抱着手，一脸阴沉的表情。
en_us: On the other hand, her mother's hair was permed into ramen-like curls and she had exquisite makeup on her face. Although the weather was hot, she was draped in mink and wearing 10-centimeter heels. Her arms were now folded and she had a sullen expression.

source: 而她身边的男人，穿着一身花寸衫，领子上挂着个墨镜，脖子上戴着大金链子，手上戴着数个金戒指，留着光头，简直就是暴发户本户。
en_us: The bald man beside her was wearing a floral shirt with a pair of shades hanging on his collar and a large gold chain around his neck. He was also wearing a few gold rings on his fingers. He was a typical nouveau riche.

source: 而是她身旁的男人。
en_us: It was the man beside her who did.

source: 而此时楼下，坐着吃饭的只有叶眉母女。
en_us: At this moment, Ye Mei and her mother were the only ones who were having a meal downstairs.

source: 而此时车上，车子停下，徐凤年见怀中的人儿还没有要下去的意思，不禁挑了挑眉，“你这是要我抱你下去？”
en_us: At this moment, Xu Fengnian was looking at the girl in his arms who still refused to get down even though the car had already stopped. He couldn't help but raise his brows and ask, "Do you want me to carry you?"

source: 而此时，豪华的铁门门口，此时站满了穿着绅士西装，接待客人们的侍者。
en_us: At this moment, there were numerous stewards who were dressed in gentlemen's suits and waiting to receive the guests at the metal gate.

source: 而自己呢，只能在一旁艳羡的看着。
en_us: On the other hand, she could only stand at the side and watch with envy.

source: 而自己，无论怎么努力，依旧还是没被人放在心上。
en_us: No matter how hard she worked, she still didn't mean anything to him.

source: 而讨好叶漓，对他来说，简直轻而易举。
en_us: To him, it was a piece of cake to please Ye Li.

source: 而这些，都是拜叶漓所赐。
en_us: It was all Ye Li's fault.

source: 而这群人，有不少都是帝都大学的学生。
en_us: Most of them were students of Beijing University.

source: 而那个方向，正站着刚刚他们议论的对象。
en_us: The people whom they were just discussing about, happened to be standing at the spot that he was running towards.

source: 肯定很精彩吧？
en_us: 'It must be very interesting, huh?'

source: 肯定是这样的，叶漓什么都比不过她，学习差，长得又胖，现在的男人谁不喜欢身材好的女孩子，学校里的男生都看不上她，徐凤年这样身份的人又怎么可能看得上。
en_us: 'That must be it. Ye Li is inferior to be in every aspect. Her grades her poor and she's chubby. All men like girls with good figures nowadays and the boys in school don't like her either. How could someone of Xu Fengnian's status be attracted to her?'

source: 胸口有些发暖。
en_us: She felt a warm, fuzzy feeling in her heart.

source: 能来这贵族学校教书，对于一个老师来说就是恩赐，说出去别人都会羡慕的存在。
en_us: To any teacher, being able to teach in such a prestigious school for nobles was definitely a blessing and something that would make others envious.

source: 能让她走到自杀这个地步，还能没事？
en_us: 'She even tried to take her own life. How could she be alright?'

source: 能这么近距离的接触本人，她都快腿软了。
en_us: Being in such close contact with Ye Feng and seeing him so up close, her legs were almost turning into jelly.

source: 脸上却是一副得了便宜还卖乖的表情：“哼，那我就勉为其难的答应你。”
en_us: Refusing to admit that she had received a benefit, she said, "Hmph, I shall make do and agree."

source: 脸上带着柔和的笑容，跟刚刚在教室里面的那个她仿佛换了个人。
en_us: There was a gentle smile on her face and she seemed completely different from the Ye Li in the classroom just now.

source: 脸上甚至没带一点妆容，放大了脸上的绒毛都可见。
en_us: She was completely barefaced as well. If one were to zoom in on the photo, they would be able to see every strand of hair on her face.

source: 脸上画着淡淡的妆容，却格外的好看。
en_us: Although her makeup was light, she looked exceptionally beautiful.

source: 脸色徒然阴沉了下去。
en_us: His face suddenly grew sullen.

source: 腿上的疼痛不似作假，哥哥们的担忧又是那般清晰可见。
en_us: The pain in her legs felt real and her brothers were clearly worried about her too.

source: 自从老大一家决定和叶家联姻之后，她就打听了不少关于叶漓的事情。
en_us: Ever since her brother-in-law decided to let their son marry Ye Li, she had found out a lot about the latter.

source: 自家女儿的性格他清楚，每次那个于向阳过来，都会很开心，喜爱之色溢于言表。
en_us: He understood his daughter's character very well. Whenever Yu Xiangyang visited, she would be on cloud nine and she would be gushing with adoration for him.

source: 自家妹妹讨厌徐凤年都讨厌疯了，怎么可能愿意坐他的车回来？
en_us: 'Sister hates Xu Fengnian to the core. How could she be willing to come home in his car?'

source: 自家的宝贝，要配也是配最好的！
en_us: 'Ye Li is our precious baby, she must marry the best man!'

source: 自己一个女孩子都那么主动了，他竟然还怀疑她，甚至没有回应，害得她下不来台，还是说现在的他对自己并没有什么男女感情，只是因为两家人的关系，才会答应这个联姻？
en_us: 'I'm a girl but I've already taken the initiative and yet, he's still suspecting me. He didn't respond either and he's making me feel so embarrassed. Or does he not have any romantic feelings for me yet? Did he agree to the marriage only because of the relationship between our families?'

source: 自己不好看？
en_us: 'Am I not good looking enough?'

source: 自己之前给大家的印象实在太深刻了，以至于现在都不敢相信她所说的这些话。
en_us: Previously, she had given them a deep impression that she hated Xu Fengnian. Hence, they couldn't believe her words now.

source: 自己二十三岁就嫁给了徐凤年，之后就再也没有回过家了。
en_us: She had married Xu Fengnian at the age of twenty-three and ever since then, she had never returned home.

source: 自己收不到邀请函，只能依靠别人。
en_us: Since Ye Li did not have an invitation card, she had no choice but to rely on others.

source: 自己日思夜想的男人就在眼前，却不能亲近，这种委屈谁受得了。
en_us: The man whom she had been thinking about all day and night was right in front of her but she couldn't get close to him at all. Who could stand being so aggrieved?

source: 自己玩了一年多微博，也堪堪才积累一百五十万粉。
en_us: After managing her Twitter account for more than a year, she had only managed to garner 1.5 million fans.

source: 自己的低调和忍让，反倒是让那些人变本加厉。
en_us: Her decision to tolerate and keep a low profile actually made those people go overboard.

source: 自己的公司，跟叶氏比起来，根本就是九牛一毛。
en_us: His company was peanuts compared to the Ye Corporation.

source: 自己的女人，那就要给她足够的安全感。
en_us: He had to give his woman enough of a sense of security.

source: 自食其果的滋味不好受，他心里复杂。
en_us: Being fed one's own medicine was a terrible feeling and he was filled with complicated emotions.

source: 至于叶漓这个不良少女，一开始的惊愕过后，老师是看也不想多看一眼。
en_us: On the other hand, the teacher stopped looking at Ye Li, the wayward girl, after being astonished for a while.

source: 舞台中央，还有着不少人随着音乐起舞。
en_us: In the middle of the stage, there were many people dancing to the music.

source: 若不是之后叶眉得逞之后，将所有一切同她炫耀，她恐是这辈子也无法知道真相。
en_us: Had Ye Mei not shown off everything to her after getting her way, she would have never known the truth in her lifetime.

source: 若不是因为两家订婚一事，她可能也不会这么着急回来。
en_us: If not for the engagement between the two families, she probably would not have hurried home so eagerly.

source: 若是上辈子的她可能已经被气死了，可如今这些人说的这些，对她来说毫无感觉。
en_us: In her previous life, she would have probably been infuriated. However, she did not feel much after reading the comments.

source: 若是叶漓愿意低头的话，或许还能想个办法。
en_us: If Ye Li was willing to swallow her pride and give in, he might be able to think of a solution.

source: 若是她真的嫁给徐凤年，到时候老大一家又多了这么大的后台，这徐家到时候，还会有他们老二一家的容身之处？
en_us: If she were to really marry Xu Fengnian, Xu Fengnian would have another powerful backer and by then, there would be no place for Xu Yuan and her parents.

source: 若是自己也同样受宠，或许他的目标就不会是她了！
en_us: If she were just as pampered as Ye Li, she would have probably caught his eye!

source: 若是这个女孩子和徐家关系不一般，那肯定也不是一般人家的小姐。
en_us: If Ye Li had a special relationship with the Xu Family, she definitely did not come from an ordinary family.

source: 若非叶漓知道他的真面目，这会儿估摸着都要沦陷了吧。
en_us: Had Ye Li not known his true colors, she would have probably fallen into his trap.

source: 落叶未央回复楚楚：“就是，@小凤漓能不能跟你妹妹学着点，能不能不要连累她了？”
en_us: Replying to Chuchu, Falling Leaves: "Yeah, @LittleYeLi, can you please learn to be like your sister and stop getting her involved?"

source: 落寞的雪转发了微博：“我不相信，这不是真的，你们都在骗我！”
en_us: Lonely Snow reblogged: "I don't believe it, this is not real, you're all lying to me!"

source: 落英冰粉回复周周小公举：“实证，我当时也在现场，我也懵逼了，啊啊啊，我的青春，我的爱情，啊啊啊，我好想哭，我要将那个叶漓大卸八块，枫神是我们的，她怎么敢啊！”
en_us: Replying to Little Princess, Ice Fan: "That's true. I was there at there at the time and I was dumbfounded too. Ahhh, my youth, my love, ahhh, I really want to cry. I want to chop that Ye Li up. Ye Feng belongs to us. How dare she!"

source: 落英冰粉：“你就是叶漓是吗？请你把枫神还给我们，他是我们大家的，不是你一个人的，请你gunok?”
en_us: Icy Fan: "You're, Ye Li, right? Please return Ye Feng ot us. He belongs to us, not you, please get lost, okay?"

source: 落英冰粉：“同上，你看她因为这件事都吸了多少粉丝了，真是不要脸，竟然蹭咱们偶像热度。”
en_us: Ice Fan: "I agree. Look how many followers she has gained because of this. She's really shameless for using our idol for fame."

source: 虽然下午发生了什么叶漓并不清楚。
en_us: Although Ye Li was not clear about what happened in the afternoon, she could imagine how scornful and dismayed Ye Mei must have looked at the time.

source: 虽然下面依旧是满满的骂声，但是看着这么多粉丝，她心里还是嫉妒的不行。
en_us: Although the page was filled with spiteful and malicious comments targeted at Ye Li, she was still extremely jealous to see that Ye Mei had a large number of followers.

source: 虽然不得不承认，这样的她确实像是换了一个人一般。
en_us: Although she undeniably looked like a whole different person, that was not what Ye Mei wanted to see.

source: 虽然不知道叶漓他们到底做了什么。
en_us: Although she did not know what Ye Li had done to them, she dared not dig her own grave anymore.

source: 虽然不知道徐晗家到底什么家世。
en_us: Although she did not have a clear understanding of Xu Han's family background, she could tell from his usual sartorial choices that he definitely did not come from a simple family.

source: 虽然两兄弟关系不错，但是叶漓很清楚，没有谁能在她三个哥哥的眼中比得过她，所以闹崩是迟早的事情。
en_us: Although the two of them were good friends, Ye Li knew clearly that no one could compare to her, in the eyes of her brothers. Hence, it was only a matter of time before they fell out with each other.

source: 虽然从小家里人过度宠溺，但是叶漓的性格并没有变得娇蛮。
en_us: Although she had always been overly pampered by her family, Ye Li did not become a spoiled and demanding brat.

source: 虽然他之前也有这种想法，但是并不太确定，可这会儿连叶眉都这么说，那就不是没有可能。
en_us: Although he had had such thoughts previously, he wasn't too sure but now that Ye Mei had said so too, he felt that it might be possible.

source: 虽然他们这样拍照能获得一定的关注和资金，但是不是谁都想要红的，有些人就十分讨厌被人偷拍，听说前几天有个男的就是拍了个学校的风云人物被人当场抓包，结果第二天就被那人的粉丝们揍进了医院。
en_us: Although they could get a certain number of followers and money from taking such photos, not everyone wanted to be famous. Some people hated having their photographs sneakily taken. A few days ago, one of the famous campus figures immediately caught someone taking photos of him red-handed. In the end, that person was beaten up by the famous figure and sent to the hospital.

source: 虽然几个儿子已经报备过女儿的情况，但是这个中年男人还是不放心。
en_us: Although his sons had already informed him of his daughter's situation, that middle-aged man was still worried.

source: 虽然只是六斤，但是镜中的自己，和才回来时那辣眼睛如同贞子一样的女孩已经相差了个天地。
en_us: Although it was only three kilograms, she looked drastically different from her hideous self in the past, which resembled Sadako.

source: 虽然叶漓的改变确实让人惊讶。
en_us: Although they were indeed astonished by Ye Li's changes, that could not erase the scandals that she had been involved in previously.

source: 虽然在大学的生活过的是一点也不好。
en_us: Although her life in college was simply a torture for her, she wouldn't drop out just because of that.

source: 虽然她好似没有怪罪他们，但是这件事发生了就是发生了，他们也不可能当做没出现过，现在阿漓的表现更是让三人都拿不准，心里很是担心，怕她再次做出傻事。
en_us: Although she did not seem to blame them, the incident had indeed happened and they couldn't pretend that it did not. They could not figure out why she was behaving the way she was now and they were very worried that she might do something silly again.

source: 虽然她觉得是同父异母，但是因为从小一起长大，叶漓跟她又同龄，所以她对叶眉并没有什么恨意，反倒是真心的将她当好姐妹对待。
en_us: Although she felt that they were half-sisters, she did not have any hatred for Ye Mei and even genuinely treated her as her close sister because they grew up together and they were the same age.

source: 虽然孩子变化很大，不过她还是一眼认出来了，“孩子，你跟你妈妈真的是越来越像了。”
en_us: Although Ye Li had changed a lot, she still managed to recognize her immediately, "Ye Li, you're starting to look more and more like your mother."

source: 虽然对方在看到他的瞬间，已经转换成了一副文质彬彬的姿态，但是眼中带着的不悦可瞒不过他。
en_us: Although Yu Xiangyang returned to his usual, polite self when he saw Ye Ming, the unhappiness in his eyes could not be hidden from the latter.

source: 虽然帝都是贵族大学，对穿着上比较严格，也有属于自己的校服，但是大多数的女生都不会穿。
en_us: Although Beijing University was a college for nobles and had a stricter dress code, most girls would choose not to wear the official uniform.

source: 虽然很恨叶漓，但是枫神依旧是她的偶像啊。
en_us: Although she hated Ye Li, Ye Feng was still her idol.

source: 虽然心里很是奇怪，但是被人关心的感觉确实不错，至少徐晗是自己回学校至今，唯一没有敌意的人。
en_us: Although she found it strange, she liked the feeling of being cared for. At least, Xu Han was the only person in school who did not show her any hostility so far.

source: 虽然是文艺系的系草，但是此人性格极差，没有人能和他搭上关系，或者说上几句话，不少表白的女孩子还听说被他直男直语气哭过。
en_us: Although he was a beau of the Faculty of The Arts, he had a terrible personality and no one could get close to him or even speak to him at all. Rumor had it that many girls who confessed to him even cried because of his harsh and blunt words.

source: 虽然是这样说着，但是他已经掏出了手机，一边絮絮叨叨：“我告诉你啊，公司好不容易给你放个假，你可别再给我整什么幺蛾子，前几天跟于向阳那件事好不容易才下去，我可不想再给你收拾烂摊子了巴拉巴拉....你听到了吗？”他说完，歪头看向低头敲手机屏幕的叶枫。
en_us: Despite saying so, he had already whipped out his mobile phone and was nagging continuously, "The company has finally agreed to let you go on a break. Don't create any trouble again. After much effort, the matter between you and Yu Xiangyang finally died down. I don't want to clear the mess you create again... do you hear me?" After saying that, he tilted his head and looked at Ye Feng who was staring at his mobile phone with his head lowered.

source: 虽然有些不敢相信他们班长会是那样的人，但是如今被ys实锤，大家剩下的也只有心情复杂。
en_us: Although some of them dared not believe that their class president would be such a person, they were filled with complicated emotions because Ye Mei had indeed been exposed by YS Fashion.

source: 虽然有些疑惑，但是徐凤年确实也想多看看她。
en_us: Although Xu Fengnian was a little doubtful and apprehensive, he did want to look at her for longer.

source: 虽然有些疑惑，但是看老爷子和大夫人的脸色难看，二夫人心里稍稍舒服了一些，看向叶漓的眼神却充满了不认同：“阿漓你这样就不对了，你既然答应了我们徐家的联姻，那也算是凤年的未婚妻，怎么能在外面闹出这样的事情来呢？这置我们徐家为何地。”她义愤填膺的说。
en_us: Despite feeling bewildered, Kong Yun felt slightly more at ease when she saw the gloomy expressions of Xu Fengnian's grandfather and Mrs. Xu. Looking at Ye Li with disapproval, she said, "Ye Li, it's wrong of you to say that. Since you've already agreed to the marriage, you're considered Xu Fengnian's fiancée too. How can you be involved in such a scandal? What is this going to do to the Xu Family's reputation?" she questioned righteously.

source: 虽然每一个人都不是一个风格，但是各有特色，不比他们徐家男人差！
en_us: Although they each had a different style, they were very unique and nowhere inferior to the men of the Xu Family!

source: 虽然瘦确实穿衣好看，但是摸起来手感不好啊。
en_us: Although thinner girls really tend to look better in clothes, they were not nice to touch.

source: 虽然知道她不喜欢自己，但是这种事，还是第一次出现。
en_us: Although he knew that she didn't like him, it was the first time that something like that happened.

source: 虽然胖，但是也不是没有好处的。
en_us: Although she was chubby, there were benefits to that.

source: 虽然说叶漓是枫神的妹妹，可这一幕还是好刺眼！
en_us: Although Ye Li was Ye Feng's younger sister, the scene was still an eyesore to her!

source: 虽然说这是事实，但是他们知道是一回事，叶眉当着徐凤年的面说出来又是另一回事了！
en_us: Although it was a matter of fact, it was one thing for them to be aware of it, and another thing for Ye Mei to say it out loud in front of Xu Fengnian!

source: 虽然这些对叶枫来说没有什么，但是妹妹夸赞，他顿时就自豪了。
en_us: Although that was nothing to Ye Feng, he was immediately proud after receiving a compliment from his younger sister.

source: 表情更怪异。
en_us: Her expression was strange.

source: 表白枫神：“不可能，我不相信，这不是真的！”
en_us: Confess to Ye Feng: "Impossible, I don't believe it, it's not true!"

source: 被捏着的手又紧了紧。
en_us: He tightened his grip on her hand.

source: 裙子很好的遮挡住了她圆润的身材，脚下穿着一双水晶鞋，衬托的一双小脚丫又白又嫩，好看极了。
en_us: The dress hid her chubby body well and the pair of crystal shoes that she was wearing made her feet look fair and tender.

source: 裙子设计的是法国宫廷风，也不夸张，放在聚会中，绝对是小清新的存在。
en_us: The dress had a French palace style design that was not exaggerated. She would definitely look fresh and stand out from the crowd at the gathering.

source: 要不是后面她自己去买东西，刷卡的时候人家说里面没钱，闹了个笑话她都不知道。
en_us: She probably would have never found out about it if she hadn't gone out to buy something and ended up making a fool out of herself after that.

source: 要不是看到她眼中的狡诈，他还真以为这丫头什么都不懂。
en_us: If he hadn't seen the cunningness in her eyes, he would have really thought that she was clueless.
